# SlabFromPoly

## Description
Creates a slab object from the referenced polyline. The current settings for the slab object are used to create the new slab.

```pascal
PROCEDURE SlabFromPoly(poly : HANDLE);
```

```python

def vs.SlabFromPoly(poly):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|poly|HANDLE|The polyline that the slab will be created from.|

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural